{
    "Kingdom": "Animalia",
    "Phylum": "Chordata",
    "Class": "Amphibia",
    "Order": "Urodela",
    "Family": "Cryptobranchidae",
    "Prey": "Aquatic life, including crabs, fish, frogs and giant salamanders",
    "Name Of Young": "Larvae",
    "Group Behavior": "Solitary",
    "Fun Fact": "Cryptobranchus giant salamanders breathe mostly through their skin.",
    "Estimated Population Size": "The South China giant salamander may be extinct, and there are less than 50,000 Chinese giant salamanders and 590 Ozark hellbenders left in the wild. Biologists aren't quite sure how many Japanese giant salamanders are left in the wild though its conservation status is near threatened. There are about 13,000 Pacific giant salamanders in British Columbia.",
    "Biggest Threat": "Pollution, habitat destruction, over-harvesting",
    "Most Distinctive Feature": "Their size",
    "Other Name(s)": "Hellbenders are called hellbender salamander, devil dog, water dog, mud dog, grampus, mud devil, Allegheny alligator and leverian water newt. Chinese giant salamanders are called infant fish because they make a noise like a baby’s cry. The Japanese giant salamander is called the giant pepper fish, or Ōsanshōuo because of the smell it gives off.",
    "Gestation Period": "40 to 210 days before eggs hatch",
    "Litter Size": "83 to 600 eggs",
    "Diet": "Omnivore",
    "Type": "Amphibian",
    "Common Name": "Giant salamander, hellbender, Japanese giant salamander, Chinese giant salamander, South China giant salamander, Pacific giant salamander",
    "Location": "East Asia, eastern United States, Canada",
    "Group": "Solitary",
    "Colour": "BrownGreyBlack",
    "Skin Type": "Smooth",
    "Lifespan": "Up to 50 years, though oldest specimen lived 72 years",
    "Weight": "0.89 to 130 pounds",
    "Length": "Up to 6.5 feet",
    "Age of Sexual Maturity": "Five to eight years",
    "Name": "Giant Salamander",
    "Status": "Least Concern",
    "locations": [
        "Asia",
        "North-America"
    ]
}